app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "吃飯"], ["status", "f"], ["created_at", "2015-04-12 15:46:42.976178"], ["updated_at", "2015-04-12 15:46:42.976178"]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", "t"], ["updated_at", "2015-04-13 14:22:33.371314"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)